NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM22/MGM220PC22HNA.svd
        <register>
          <name>PGATRIM</name>
          <description></description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000547</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>PGACTUNE</name>
              <description>PGACTUNE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cfb_0p7</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cfb_nominal</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cfb_1p32</name>
                  <description></description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGADISANTILOCK</name>
              <description>PGADISANTILOCK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>antilock_enable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>antilock_disable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAVCMOUTTRIM</name>
              <description>PGAVCMOUTTRIM</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vcm_out_0p4</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p45</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p5</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p55</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p6</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p65</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p7</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vcm_out_0p75</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAVLDOTRIM</name>
              <description>PGAVLDOTRIM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vdda_1p15</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p2</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p25</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p3</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p35</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p4</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p5</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vdda_1p55</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PGACAL</name>
          <description></description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
          <resetValue>0x20202020</resetValue>
          <resetMask>0x3F3F3F3F</resetMask>
          <fields>
            <field>
              <name>PGAOFFNCALI</name>
              <description>PGAOFFNCALI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>offset_m_300mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>offset_p_300mv</name>
                  <description></description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAOFFNCALQ</name>
              <description>PGAOFFNCALQ</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>offset_m_300mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>offset_p_300mv</name>
                  <description></description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAOFFPCALI</name>
              <description>PGAOFFPCALI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>offset_m_300mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>offset_p_300mv</name>
                  <description></description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAOFFPCALQ</name>
              <description>PGAOFFPCALQ</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>offset_m_300mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>offset_p_300mv</name>
                  <description></description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL</name>
          <description></description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <resetMask>0x07FFFEEF</resetMask>
          <fields>
            <field>
              <name>PGABWMODE</name>
              <description>PGABWMODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bw_5MHz</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bw_2p5MHz</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bw_1p67MHz</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bw_1p25MHz</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENBIAS</name>
              <description>PGAENBIAS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bias_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bias_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENGHZ</name>
              <description>PGAENGHZ</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ghz_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ghz_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENLATCHI</name>
              <description>PGAENLATCHI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pkd_latch_i_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pkd_latch_i_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENLATCHQ</name>
              <description>PGAENLATCHQ</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pkd_latch_q_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pkd_latch_q_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENLDOLOAD</name>
              <description>PGAENLDOLOAD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable_ldo_load</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_ldo_load</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENPGAI</name>
              <description>PGAENPGAI</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pgai_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pgai_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENPGAQ</name>
              <description>PGAENPGAQ</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pgaq_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pgaq_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENPKD</name>
              <description>PGAENPKD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pkd_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pkd_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAENRCMOUT</name>
              <description>PGAENRCMOUT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>rcm_out_disable</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rcm_out_enable</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAPOWERMODE</name>
              <description>PGAPOWERMODE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pm_typ</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pm_0p9</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pm_1p2</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pm_0p8</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGATHRPKDLOSEL</name>
              <description>PGATHRPKDLOSEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref50mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref75mv</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref100mv</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref125mv</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref150mv</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref175mv</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref200mv</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref225mv</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref250mv</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref275mv</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref300mv</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGATHRPKDHISEL</name>
              <description>PGATHRPKDHISEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref50mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref75mv</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref100mv</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref125mv</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>verf150mv</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref175mv</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref200mv</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref225mv</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref250mv</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref275mv</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref300mv</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNAMIXRFPKDTHRESHSEL</name>
              <description>LNAMIXRFPKDTHRESHSEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
